ubco-db/EmbedDB/custom_variants/memboard/variant.h
/*
  Copyright (c) 2014-2016 Arduino LLC.  All right reserved.
  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.
  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.
  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_ARDUINO_ZERO_
#define _VARIANT_ARDUINO_ZERO_

// The definitions here needs a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		(32768ul)

/** Master clock frequency */
#define VARIANT_MCK			  (48000000ul)

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"
#undef    DAC               // No DAC, so remove as this is based on Feather M0
#include <Arduino.h>

#ifdef __cplusplus
#include "SERCOM.h"
#include "Uart.h"
#endif // __cplusplus

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
#ifdef __cplusplus
extern "C" unsigned int PINCOUNT_fn();
#endif
#define PINS_COUNT           (46ul)
#define NUM_DIGITAL_PINS     (19ul)
#define NUM_ANALOG_INPUTS    (0ul)
#define NUM_ANALOG_OUTPUTS   (01ul)
#define analogInputToDigitalPin(p)  ((p < 6u) ? (p) + 24u : -1)

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

// LEDs
#define CHK_LED                 (00ul)
#define PULSE_LED               (01ul)
// #define PIN_LED_TXL          (31u)
// #define PIN_LED              PIN_LED_13
// #define PIN_LED2             PIN_LED_RXL
// #define PIN_LED3             PIN_LED_TXL
// #define LED_BUILTIN          PIN_LED_13


/*
 * Analog pins
 */
#define PIN_A0                  (29ul)
// #define PIN_A1               (25ul)
// #define PIN_A2               (26ul)
// #define PIN_A3               (27ul)
// #define PIN_A4               (28ul)
// #define PIN_A5               (29ul)
// #define PIN_DAC0             (24ul)

static const uint8_t A0  = PIN_A0;
// static const uint8_t A1  = PIN_A1;
// static const uint8_t A2  = PIN_A2;
// static const uint8_t A3  = PIN_A3;
// static const uint8_t A4  = PIN_A4;
// static const uint8_t A5  = PIN_A5;
// static const uint8_t DAC0 = PIN_DAC0;
// #define ADC_RESOLUTION		12


/*
 * Serial interfaces
 */
// Serial (EDBG)
// #define PIN_SERIAL_RX       (36ul)
// #define PIN_SERIAL_TX       (35ul)
// #define PAD_SERIAL_TX       (UART_TX_PAD_2)
// #define PAD_SERIAL_RX       (SERCOM_RX_PAD_3)

// Serial1
// #define PIN_SERIAL1_RX       (0ul)
// #define PIN_SERIAL1_TX       (1ul)
// #define PAD_SERIAL1_TX       (UART_TX_PAD_2)
// #define PAD_SERIAL1_RX       (SERCOM_RX_PAD_3)

/*
 * SPI Interfaces
 */
/** 
 * @TODO -> this is for preconfiged SPI */
#define SPI_INTERFACES_COUNT 1

/** Board needs at least one SPI */


/**
 * Sercom 0 configuration for SD card
 **/
#define MOSI_SD         2ul
#define SCLK_SD         3ul
#define MISO_SD         4ul
#define CS_SD           5ul
#define SD_SPI          sercom0


#define PIN_SPI_MISO          (4ul)
#define PIN_SPI_MOSI          (2ul)
#define PIN_SPI_SCK           (3ul)
#define PERIPH_SPI            sercom0
#define PAD_SPI_TX            SPI_PAD_0_SCK_1
#define PAD_SPI_RX            SERCOM_RX_PAD_2

static const uint8_t SS	  =   5ul;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;

/*
 * Wire Interfaces
 */

// #define WIRE_INTERFACES_COUNT 1

// #define PIN_WIRE_SDA         (16u)
// #define PIN_WIRE_SCL         (17u)
// #define PERIPH_WIRE          sercom3
// #define WIRE_IT_HANDLER      SERCOM3_Handler

// static const uint8_t SDA = PIN_WIRE_SDA;
// static const uint8_t SCL = PIN_WIRE_SCL;

/*
 * USB
 */
#define PIN_USB_HOST_ENABLE (46ul)
#define PIN_USB_DM          (27ul)
#define PIN_USB_DP          (28ul)

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

/*	=========================
 *	===== SERCOM DEFINITION
 *	=========================
*/
extern SERCOM sercom0;
extern SERCOM sercom1;
extern SERCOM sercom2;
extern SERCOM sercom4;
extern SERCOM sercom5;

//extern Uart Serial;

#endif

#ifdef __cplusplus
extern "C" {
#endif
unsigned int PINCOUNT_fn();
#ifdef __cplusplus
}
#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL      Serial
#define SERIAL_PORT_MONITOR         Serial

//#define Serial                      SERIAL_PORT_USBVIRTUAL

// Serial has no physical pins broken out, so it's not listed as HARDWARE port
//#define SERIAL_PORT_HARDWARE        Serial1
//#define SERIAL_PORT_HARDWARE_OPEN   Serial1

// Legacy way to describe serial port on pins 0-1
//#define Serial5   Serial1

#endif /* _VARIANT_ARDUINO_ZERO_ */